In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import datetime as dt

In [2]:
df = pd.read_csv("NAS.csv")

In [3]:
df.head(10)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2003-12-18,19.482599,19.596901,19.025499,19.139799,19.139799,4978496.0
1,2003-12-19,19.368299,19.425501,18.282801,18.454201,18.454201,1410901.0
2,2003-12-22,18.739901,18.739901,17.997101,18.054300,18.054300,137047.0
3,2003-12-23,17.997101,17.997101,17.368700,17.425800,17.425800,229418.0
4,2003-12-24,NaN,NaN,NaN,NaN,NaN,NaN
5,2003-12-25,NaN,NaN,NaN,NaN,NaN,NaN
6,2003-12-26,NaN,NaN,NaN,NaN,NaN,NaN
7,2003-12-29,17.425800,17.425800,16.854500,17.254400,17.254400,196206.0
8,2003-12-30,17.425800,17.882900,17.425800,17.711500,17.711500,67298.0
9,2003-12-31,NaN,NaN,NaN,NaN,NaN,NaN

## drop null verdi

In [4]:
df.replace(0, np.nan, inplace=True) #replace 0 with nan
df.dropna(inplace=True)  #remove all nan.

In [5]:
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2003-12-18,19.482599,19.596901,19.025499,19.139799,19.139799,4978496.0
1,2003-12-19,19.368299,19.425501,18.282801,18.454201,18.454201,1410901.0
2,2003-12-22,18.739901,18.739901,17.997101,18.054300,18.054300,137047.0
3,2003-12-23,17.997101,17.997101,17.368700,17.425800,17.425800,229418.0
7,2003-12-29,17.425800,17.425800,16.854500,17.254400,17.254400,196206.0

## Random forest regression

In [6]:
dato = df['Date'] 
dato = pd.to_datetime(dato) # making datetime object off date string
dato = dato.map(dt.datetime.toordinal) #making dt object to int.

In [7]:
X = dato.values.reshape(-1, 1)
y = df['Close'].values

In [8]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)

In [9]:
from sklearn.ensemble import RandomForestRegressor
model=RandomForestRegressor(n_estimators=500, criterion='mse', random_state=0)
model.fit(X_train, y_train)

RandomForestRegressor(n_estimators=500, random_state=0)

In [10]:
y_pred=model.predict(X_test)
y_pred=y_pred.reshape(-1, 1)

In [11]:
from sklearn import metrics  
print("MAE", metrics.mean_absolute_error(y_test, y_pred))
print("MSE", metrics.mean_squared_error(y_test, y_pred))
print("RMSE", np.sqrt(metrics.mean_squared_error(y_test, y_pred)))
print("Score:", model.score(X_test, y_test))

MAE 1.5898976727799983
MSE 8.148970055670805
RMSE 2.8546400921431068
Score: 0.9972090086612851

In [12]:
input_date = dt.date(2010, 10, 29)
input_dateod = input_date.toordinal()
predict_value = model.predict([[input_dateod]])

In [13]:
print(f' predicted value for  {input_date} is: {predict_value}')

 predicted value for  2010-10-29 is: [51.65058131]